app/views/events/buy.html.erb

Select the amount of tickets you want to purchase for the event:
<p><%= Event.find_by(id: params[:event_id]).name %></p>
<p><%= Event.find_by(id: params[:event_id]).place.name %></p>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

<p>Prices: </p>
<% (Ticket.all.where(event_id: params[:event_id])).each do |t| %>
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]